GopalSaraf/Practicals/PSDL/include/proc/pic16c926.inc
// Register: LCDCON
#define LCDCON LCDCON
LCDCON                                   equ 010Fh
// bitfield definitions
LCDCON_LMUX_POSN                         equ 0000h
LCDCON_LMUX_POSITION                     equ 0000h
LCDCON_LMUX_SIZE                         equ 0002h
LCDCON_LMUX_LENGTH                       equ 0002h
LCDCON_LMUX_MASK                         equ 0003h
LCDCON_CS_POSN                           equ 0002h
LCDCON_CS_POSITION                       equ 0002h
LCDCON_CS_SIZE                           equ 0002h
LCDCON_CS_LENGTH                         equ 0002h
LCDCON_CS_MASK                           equ 000Ch
LCDCON_VGEN_POSN                         equ 0004h
LCDCON_VGEN_POSITION                     equ 0004h
LCDCON_VGEN_SIZE                         equ 0001h
LCDCON_VGEN_LENGTH                       equ 0001h
LCDCON_VGEN_MASK                         equ 0010h
LCDCON_SLPEN_POSN                        equ 0006h
LCDCON_SLPEN_POSITION                    equ 0006h
LCDCON_SLPEN_SIZE                        equ 0001h
LCDCON_SLPEN_LENGTH                      equ 0001h
LCDCON_SLPEN_MASK                        equ 0040h
LCDCON_LCDEN_POSN                        equ 0007h
LCDCON_LCDEN_POSITION                    equ 0007h
LCDCON_LCDEN_SIZE                        equ 0001h
LCDCON_LCDEN_LENGTH                      equ 0001h
LCDCON_LCDEN_MASK                        equ 0080h
LCDCON_LMUX0_POSN                        equ 0000h
LCDCON_LMUX0_POSITION                    equ 0000h
LCDCON_LMUX0_SIZE                        equ 0001h
LCDCON_LMUX0_LENGTH                      equ 0001h
LCDCON_LMUX0_MASK                        equ 0001h
LCDCON_LMUX1_POSN                        equ 0001h
LCDCON_LMUX1_POSITION                    equ 0001h
LCDCON_LMUX1_SIZE                        equ 0001h
LCDCON_LMUX1_LENGTH                      equ 0001h
LCDCON_LMUX1_MASK                        equ 0002h
LCDCON_CS0_POSN                          equ 0002h
LCDCON_CS0_POSITION                      equ 0002h
LCDCON_CS0_SIZE                          equ 0001h
LCDCON_CS0_LENGTH                        equ 0001h
LCDCON_CS0_MASK                          equ 0004h
LCDCON_CS1_POSN                          equ 0003h
LCDCON_CS1_POSITION                      equ 0003h
LCDCON_CS1_SIZE                          equ 0001h
LCDCON_CS1_LENGTH                        equ 0001h
LCDCON_CS1_MASK                          equ 0008h
LCDCON_BIAS_POSN                         equ 0004h
LCDCON_BIAS_POSITION                     equ 0004h
LCDCON_BIAS_SIZE                         equ 0001h
LCDCON_BIAS_LENGTH                       equ 0001h
LCDCON_BIAS_MASK                         equ 0010h
LCDCON_WERR_POSN                         equ 0005h
LCDCON_WERR_POSITION                     equ 0005h
LCDCON_WERR_SIZE                         equ 0001h
LCDCON_WERR_LENGTH                       equ 0001h
LCDCON_WERR_MASK                         equ 0020h

// Register: LCDD00
#define LCDD00 LCDD00
LCDD00                                   equ 0110h
// bitfield definitions
LCDD00_SEG00_POSN                        equ 0000h
LCDD00_SEG00_POSITION                    equ 0000h
LCDD00_SEG00_SIZE                        equ 0001h
LCDD00_SEG00_LENGTH                      equ 0001h
LCDD00_SEG00_MASK                        equ 0001h
LCDD00_SEG01_POSN                        equ 0001h
LCDD00_SEG01_POSITION                    equ 0001h
LCDD00_SEG01_SIZE                        equ 0001h
LCDD00_SEG01_LENGTH                      equ 0001h
LCDD00_SEG01_MASK                        equ 0002h
LCDD00_SEG02_POSN                        equ 0002h
LCDD00_SEG02_POSITION                    equ 0002h
LCDD00_SEG02_SIZE                        equ 0001h
LCDD00_SEG02_LENGTH                      equ 0001h
LCDD00_SEG02_MASK                        equ 0004h
LCDD00_SEG03_POSN                        equ 0003h
LCDD00_SEG03_POSITION                    equ 0003h
LCDD00_SEG03_SIZE                        equ 0001h
LCDD00_SEG03_LENGTH                      equ 0001h
LCDD00_SEG03_MASK                        equ 0008h
LCDD00_SEG04_POSN                        equ 0004h
LCDD00_SEG04_POSITION                    equ 0004h
LCDD00_SEG04_SIZE                        equ 0001h
LCDD00_SEG04_LENGTH                      equ 0001h
LCDD00_SEG04_MASK                        equ 0010h
LCDD00_SEG05_POSN                        equ 0005h
LCDD00_SEG05_POSITION                    equ 0005h
LCDD00_SEG05_SIZE                        equ 0001h
LCDD00_SEG05_LENGTH                      equ 0001h
LCDD00_SEG05_MASK                        equ 0020h
LCDD00_SEG06_POSN                        equ 0006h
LCDD00_SEG06_POSITION                    equ 0006h
LCDD00_SEG06_SIZE                        equ 0001h
LCDD00_SEG06_LENGTH                      equ 0001h
LCDD00_SEG06_MASK                        equ 0040h
LCDD00_SEG07_POSN                        equ 0007h
LCDD00_SEG07_POSITION                    equ 0007h
LCDD00_SEG07_SIZE                        equ 0001h
LCDD00_SEG07_LENGTH                      equ 0001h
LCDD00_SEG07_MASK                        equ 0080h

// Register: LCDD01
#define LCDD01 LCDD01
LCDD01                                   equ 0111h
// bitfield definitions
LCDD01_SEG08_POSN                        equ 0000h
LCDD01_SEG08_POSITION                    equ 0000h
LCDD01_SEG08_SIZE                        equ 0001h
LCDD01_SEG08_LENGTH                      equ 0001h
LCDD01_SEG08_MASK                        equ 0001h
LCDD01_SEG09_POSN                        equ 0001h
LCDD01_SEG09_POSITION                    equ 0001h
LCDD01_SEG09_SIZE                        equ 0001h
LCDD01_SEG09_LENGTH                      equ 0001h
LCDD01_SEG09_MASK                        equ 0002h
LCDD01_SEG10_POSN                        equ 0002h
LCDD01_SEG10_POSITION                    equ 0002h
LCDD01_SEG10_SIZE                        equ 0001h
LCDD01_SEG10_LENGTH                      equ 0001h
LCDD01_SEG10_MASK                        equ 0004h
LCDD01_SEG11_POSN                        equ 0003h
LCDD01_SEG11_POSITION                    equ 0003h
LCDD01_SEG11_SIZE                        equ 0001h
LCDD01_SEG11_LENGTH                      equ 0001h
LCDD01_SEG11_MASK                        equ 0008h
LCDD01_SEG12_POSN                        equ 0004h
LCDD01_SEG12_POSITION                    equ 0004h
LCDD01_SEG12_SIZE                        equ 0001h
LCDD01_SEG12_LENGTH                      equ 0001h
LCDD01_SEG12_MASK                        equ 0010h
LCDD01_SEG13_POSN                        equ 0005h
LCDD01_SEG13_POSITION                    equ 0005h
LCDD01_SEG13_SIZE                        equ 0001h
LCDD01_SEG13_LENGTH                      equ 0001h
LCDD01_SEG13_MASK                        equ 0020h
LCDD01_SEG14_POSN                        equ 0006h
LCDD01_SEG14_POSITION                    equ 0006h
LCDD01_SEG14_SIZE                        equ 0001h
LCDD01_SEG14_LENGTH                      equ 0001h
LCDD01_SEG14_MASK                        equ 0040h
LCDD01_SEG15_POSN                        equ 0007h
LCDD01_SEG15_POSITION                    equ 0007h
LCDD01_SEG15_SIZE                        equ 0001h
LCDD01_SEG15_LENGTH                      equ 0001h
LCDD01_SEG15_MASK                        equ 0080h

// Register: LCDD02
#define LCDD02 LCDD02
LCDD02                                   equ 0112h
// bitfield definitions
LCDD02_SEG16_POSN                        equ 0000h
LCDD02_SEG16_POSITION                    equ 0000h
LCDD02_SEG16_SIZE                        equ 0001h
LCDD02_SEG16_LENGTH                      equ 0001h
LCDD02_SEG16_MASK                        equ 0001h
LCDD02_SEG17_POSN                        equ 0001h
LCDD02_SEG17_POSITION                    equ 0001h
LCDD02_SEG17_SIZE                        equ 0001h
LCDD02_SEG17_LENGTH                      equ 0001h
LCDD02_SEG17_MASK                        equ 0002h
LCDD02_SEG18_POSN                        equ 0002h
LCDD02_SEG18_POSITION                    equ 0002h
LCDD02_SEG18_SIZE                        equ 0001h
LCDD02_SEG18_LENGTH                      equ 0001h
LCDD02_SEG18_MASK                        equ 0004h
LCDD02_SEG19_POSN                        equ 0003h
LCDD02_SEG19_POSITION                    equ 0003h
LCDD02_SEG19_SIZE                        equ 0001h
LCDD02_SEG19_LENGTH                      equ 0001h
LCDD02_SEG19_MASK                        equ 0008h
LCDD02_SEG20_POSN                        equ 0004h
LCDD02_SEG20_POSITION                    equ 0004h
LCDD02_SEG20_SIZE                        equ 0001h
LCDD02_SEG20_LENGTH                      equ 0001h
LCDD02_SEG20_MASK                        equ 0010h
LCDD02_SEG21_POSN                        equ 0005h
LCDD02_SEG21_POSITION                    equ 0005h
LCDD02_SEG21_SIZE                        equ 0001h
LCDD02_SEG21_LENGTH                      equ 0001h
LCDD02_SEG21_MASK                        equ 0020h
LCDD02_SEG22_POSN                        equ 0006h
LCDD02_SEG22_POSITION                    equ 0006h
LCDD02_SEG22_SIZE                        equ 0001h
LCDD02_SEG22_LENGTH                      equ 0001h
LCDD02_SEG22_MASK                        equ 0040h
LCDD02_SEG23_POSN                        equ 0007h
LCDD02_SEG23_POSITION                    equ 0007h
LCDD02_SEG23_SIZE                        equ 0001h
LCDD02_SEG23_LENGTH                      equ 0001h
LCDD02_SEG23_MASK                        equ 0080h

// Register: LCDD03
#define LCDD03 LCDD03
LCDD03                                   equ 0113h
// bitfield definitions
LCDD03_SEG24_POSN                        equ 0000h
LCDD03_SEG24_POSITION                    equ 0000h
LCDD03_SEG24_SIZE                        equ 0001h
LCDD03_SEG24_LENGTH                      equ 0001h
LCDD03_SEG24_MASK                        equ 0001h
LCDD03_SEG25_POSN                        equ 0001h
LCDD03_SEG25_POSITION                    equ 0001h
LCDD03_SEG25_SIZE                        equ 0001h
LCDD03_SEG25_LENGTH                      equ 0001h
LCDD03_SEG25_MASK                        equ 0002h
LCDD03_SEG26_POSN                        equ 0002h
LCDD03_SEG26_POSITION                    equ 0002h
LCDD03_SEG26_SIZE                        equ 0001h
LCDD03_SEG26_LENGTH                      equ 0001h
LCDD03_SEG26_MASK                        equ 0004h
LCDD03_SEG27_POSN                        equ 0003h
LCDD03_SEG27_POSITION                    equ 0003h
LCDD03_SEG27_SIZE                        equ 0001h
LCDD03_SEG27_LENGTH                      equ 0001h
LCDD03_SEG27_MASK                        equ 0008h
LCDD03_SEG28_POSN                        equ 0004h
LCDD03_SEG28_POSITION                    equ 0004h
LCDD03_SEG28_SIZE                        equ 0001h
LCDD03_SEG28_LENGTH                      equ 0001h
LCDD03_SEG28_MASK                        equ 0010h
LCDD03_SEG29_POSN                        equ 0005h
LCDD03_SEG29_POSITION                    equ 0005h
LCDD03_SEG29_SIZE                        equ 0001h
LCDD03_SEG29_LENGTH                      equ 0001h
LCDD03_SEG29_MASK                        equ 0020h
LCDD03_SEG30_POSN                        equ 0006h
LCDD03_SEG30_POSITION                    equ 0006h
LCDD03_SEG30_SIZE                        equ 0001h
LCDD03_SEG30_LENGTH                      equ 0001h
LCDD03_SEG30_MASK                        equ 0040h
LCDD03_SEG31_POSN                        equ 0007h
LCDD03_SEG31_POSITION                    equ 0007h
LCDD03_SEG31_SIZE                        equ 0001h
LCDD03_SEG31_LENGTH                      equ 0001h
LCDD03_SEG31_MASK                        equ 0080h

// Register: LCDD04
#define LCDD04 LCDD04
LCDD04                                   equ 0114h
// bitfield definitions
LCDD04_SEG00_POSN                        equ 0000h
LCDD04_SEG00_POSITION                    equ 0000h
LCDD04_SEG00_SIZE                        equ 0001h
LCDD04_SEG00_LENGTH                      equ 0001h
LCDD04_SEG00_MASK                        equ 0001h
LCDD04_SEG01_POSN                        equ 0001h
LCDD04_SEG01_POSITION                    equ 0001h
LCDD04_SEG01_SIZE                        equ 0001h
LCDD04_SEG01_LENGTH                      equ 0001h
LCDD04_SEG01_MASK                        equ 0002h
LCDD04_SEG02_POSN                        equ 0002h
LCDD04_SEG02_POSITION                    equ 0002h
LCDD04_SEG02_SIZE                        equ 0001h
LCDD04_SEG02_LENGTH                      equ 0001h
LCDD04_SEG02_MASK                        equ 0004h
LCDD04_SEG03_POSN                        equ 0003h
LCDD04_SEG03_POSITION                    equ 0003h
LCDD04_SEG03_SIZE                        equ 0001h
LCDD04_SEG03_LENGTH                      equ 0001h
LCDD04_SEG03_MASK                        equ 0008h
LCDD04_SEG04_POSN                        equ 0004h
LCDD04_SEG04_POSITION                    equ 0004h
LCDD04_SEG04_SIZE                        equ 0001h
LCDD04_SEG04_LENGTH                      equ 0001h
LCDD04_SEG04_MASK                        equ 0010h
LCDD04_SEG05_POSN                        equ 0005h
LCDD04_SEG05_POSITION                    equ 0005h
LCDD04_SEG05_SIZE                        equ 0001h
LCDD04_SEG05_LENGTH                      equ 0001h
LCDD04_SEG05_MASK                        equ 0020h
LCDD04_SEG06_POSN                        equ 0006h
LCDD04_SEG06_POSITION                    equ 0006h
LCDD04_SEG06_SIZE                        equ 0001h
LCDD04_SEG06_LENGTH                      equ 0001h
LCDD04_SEG06_MASK                        equ 0040h
LCDD04_SEG07_POSN                        equ 0007h
LCDD04_SEG07_POSITION                    equ 0007h
LCDD04_SEG07_SIZE                        equ 0001h
LCDD04_SEG07_LENGTH                      equ 0001h
LCDD04_SEG07_MASK                        equ 0080h

